%Завдання №5
help title
help legend


%Завдання №6
x=[0.0:0.1:1.6]
e=2.71;
y=(2*(e.^-(x)))/(2*x+x.^3)
subplot (1,2,1) % виводить перший графік у перше підвікно
plot(x1,y1,'r') % будує графік функції
grid on % ввімкнення сітки координат
title('Функція у1(х1)') % заголовок першої функції
legend('y1(x1)') % умовні позначення першої ф-ії
xlabel('Вісь х') % позначення вісі х
ylabel('Вісь y') % позначення вісі у

% другий графік функції y2(x2)
x2=[0:0.1:1.6]
y2=(2*(e.^-(x)))/(2*x+x.^3)
subplot(1,2,2) % виводить другий графік у друге підвікно
plot(x2,y2,'g--') % будує графік функції
grid on % ввімкнення сітки координат
title('Функція у2(х2)') % заголовок другої функції
legend('y2(x2)') % умовні позначення другої ф-ії
xlabel('Вісь х') % позначення вісі х
ylabel('Вісь y') % позначення вісі у

%Завдання 7
help comet
help comet3
t = -pi:pi/200:pi;
        comet(t,tan(sin(t))-sin(tan(t)))
        t = -pi:pi/500:pi;
        comet3(sin(5*t),cos(3*t),t)